INSERT INTO `admins` (`username`, `password`, `name`, `sex`, `job`, `telephone`, `permissions`) VALUES
    ('hanbin', '7b6a7a646d09155a7088e694457e148c', '韩彬', 'M', '前台', '18128789181', b'00000101');

INSERT INTO `roomtype` (`typeid`, `typename`, `bedsnum`, `price`, `description`) VALUES
    (1, '标准单人房', 1, 280.00, '有wifi，有窗，无餐食，18-24平方米，一张1.8米大床'),
    (2, '标准双人房', 2, 380.00, '有wifi，有窗，无餐食，24-30平方米，两张1.5米床'),
    (3, '标准三人房', 3, 480.00, '有wifi，有窗，无餐食，30-40平方米，三张1.35米床'),
    (4, '商务单人房', 1, 250.00, '有wifi，有窗，无餐食，15-18平方米，一张1.8米大床'),
    (5, '豪华套房', 2, 580.00, '有wifi，有窗，提供餐食，40-50平方米，两张1.8大床');

INSERT INTO `rooms` (`roomid`, `floor`, `status`, `price`, `description`, `roomtypeid`) VALUES
    ('A101', '1', 'idle', 280.00, '有wifi，有窗，无餐食，18-24平方米，一张1.8米大床', 1),
    ('A102', '1', 'idle', 300.00, '有wifi，有窗，无餐食，18-24平方米，一张1.8米大床', 1),
    ('A103', '1', 'idle', 280.00, '有wifi，有窗，无餐食，18-24平方米，一张1.8米大床', 1),
    ('A104', '1', 'idle', 260.00, '有wifi，无窗，无餐食，18-24平方米，一张1.8米大床', 1),
    ('A105', '1', 'idle', 280.00, '有wifi，有窗，无餐食，18-24平方米，一张1.8米大床', 1),
    ('A106', '1', 'idle', 280.00, '有wifi，有窗，无餐食，18-24平方米，一张1.8米大床', 1),
    ('A107', '1', 'idle', 280.00, '有wifi，有窗，无餐食，18-24平方米，一张1.8米大床', 1),
    ('A108', '1', 'idle', 280.00, '有wifi，有窗，无餐食，18-24平方米，一张1.8米大床', 1),
    ('A201', '2', 'idle', 380.00, '有wifi，有窗，无餐食，24-30平方米，两张1.5米床', 2),
    ('A203', '2', 'idle', 480.00, '有wifi，有窗，无餐食，30-40平方米，三张1.35米床', 3),
    ('A301', '3', 'idle', 250.00, '有wifi，有窗，无餐食，15-18平方米，一张1.8米大床', 4),
    ('A401', '4', 'idle', 580.00, '有wifi，有窗，提供餐食，40-50平方米，两张1.8大床', 5),
    ('A506', '5', 'idle', 580.00, '有wifi，有窗，提供餐食，40-50平方米，两张1.8大床', 5),
    ('B202', '2', 'idle', 380.00, '有wifi，有窗，无餐食，24-30平方米，两张1.5米床', 2),
    ('B204', '2', 'idle', 480.00, '有wifi，有窗，无餐食，30-40平方米，三张1.35米床', 3),
    ('B302', '3', 'idle', 250.00, '有wifi，有窗，无餐食，15-18平方米，一张1.8米大床', 4),
    ('B402', '4', 'invalid', 580.00, '有wifi，有窗，提供餐食，40-50平方米，两张1.8大床', 5);
    

INSERT INTO `groups` (`groupid`, `groupname`, `membersnum`, `contactname`, `contacttel`) VALUES
    (1, '禅之旅', 3, '张三', '13311112222');